{
    "user_id": "user123",
    "title": "Petualangan Menabung Andi",
    "tema": [
        "menabung",
        "kejujuran",
        "pengelolaan uang"
    ],
    "language": "indonesian",
    "status": "finished",
    "age_group": 11,
    "current_scene": 1,
    "created_at": null,
    "finished_at": null,
    "maximum_point": 10,
    "story_flow": {
        "total_scene": 10,
        "decision_point": [
            2,
            4,
            6
        ],
        "ending": [
            7,
            8,
            9,
            10
        ]
    },
    "characters": [
        {
            "name": "Andi",
            "description": "Andi is an 11-year-old boy with short black hair and a curious mind. He loves learning new things and is very interested in saving money to buy things he loves."
        },
        {
            "name": "Pak Budi",
            "description": "Pak Budi is a friendly warung owner with a warm smile and a helpful nature. He is known in the neighborhood for his honesty and generosity."
        },
        {
            "name": "Sari",
            "description": "Sari is Andi's best friend, a cheerful girl with long hair. She is always ready to help Andi in making the right decisions."
        }
    ],
    "scene": [
        {
            "scene_id": 1,
            "type": "narrative",
            "img_url": null,
            "img_description": "Andi sitting at home with his parents discussing the importance of saving money.",
            "voice_url": null,
            "content": "Pada suatu hari yang cerah, Andi duduk bersama ayah dan ibunya di ruang tamu. Mereka sedang membicarakan tentang pentingnya menabung. 'Andi, menabung itu penting agar kamu bisa membeli barang yang kamu inginkan di masa depan,' kata Ayah. 'Iya, dan kamu bisa menyimpan uangmu di bank seperti Ayah,' tambah Ibu.",
            "next_scene": 2,
            "branch": null,
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 2,
            "type": "decision_point",
            "img_url": null,
            "img_description": "Sari standing in front of a warung counter, holding some change.",
            "voice_url": null,
            "content": "Di warung, Pak Budi sedang sibuk melayani banyak pembeli. Saat memberikan kembalian, Pak Budi terburu-buru dan salah menghitung. Dia memberikan kembalian Rp 10.000 padahal seharusnya hanya Rp 5.000. Sari menyadari kesalahan ini. Apa yang sebaiknya Sari lakukan?",
            "next_scene": null,
            "branch": [
                {
                    "choice": "baik",
                    "teks": "Sari mengembalikan uang kembalian yang berlebih ke Pak Budi.",
                    "moral_value": "Kejujuran lebih penting dari segalanya.",
                    "point": 5,
                    "next_scene": 3
                },
                {
                    "choice": "buruk",
                    "teks": "Sari menyimpan uang kembalian yang berlebih.",
                    "moral_value": "Mengambil hak orang lain tidaklah benar.",
                    "point": -5,
                    "next_scene": 5
                }
            ],
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 3,
            "type": "narrative",
            "img_url": null,
            "img_description": "Pak Budi smiling gratefully at Sari for her honesty.",
            "voice_url": null,
            "content": "Sari mengembalikan uang kembalian yang berlebih kepada Pak Budi. Pak Budi tersenyum dan berterima kasih kepada Sari. 'Kamu anak yang jujur, Sari! Terima kasih sudah mengembalikan uang ini,' kata Pak Budi sambil memberikan permen sebagai hadiah.",
            "next_scene": 4,
            "branch": null,
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 4,
            "type": "decision_point",
            "img_url": null,
            "img_description": "Andi and Sari looking at a toy they want to buy with their savings.",
            "voice_url": null,
            "content": "Andi dan Sari melihat mainan yang sangat mereka inginkan di toko. Namun, uang tabungan Andi belum cukup. Apa yang sebaiknya Andi lakukan?",
            "next_scene": null,
            "branch": [
                {
                    "choice": "baik",
                    "teks": "Andi memutuskan untuk menabung lebih lama hingga uangnya cukup.",
                    "moral_value": "Kesabaran dalam menabung membuahkan hasil.",
                    "point": 5,
                    "next_scene": 7
                },
                {
                    "choice": "buruk",
                    "teks": "Andi meminjam uang dari Sari untuk membeli mainan itu sekarang.",
                    "moral_value": "Meminjam uang tanpa rencana bisa menjadi kebiasaan buruk.",
                    "point": -3,
                    "next_scene": 8
                }
            ],
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 5,
            "type": "narrative",
            "img_url": null,
            "img_description": "Sari feeling guilty while holding the extra change.",
            "voice_url": null,
            "content": "Sari menyimpan uang kembalian yang berlebih dan merasa senang sesaat. Namun, kemudian dia merasa bersalah karena tahu bahwa itu bukan miliknya. Dia bingung dan tidak nyaman.",
            "next_scene": 6,
            "branch": null,
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 6,
            "type": "decision_point",
            "img_url": null,
            "img_description": "Sari contemplating whether to return the money or not.",
            "voice_url": null,
            "content": "Sari ragu apakah harus mengembalikan uang tersebut atau tidak. Apa yang sebaiknya Sari lakukan?",
            "next_scene": null,
            "branch": [
                {
                    "choice": "baik",
                    "teks": "Sari memutuskan untuk kembali ke warung dan mengembalikan uangnya.",
                    "moral_value": "Lebih baik terlambat daripada tidak sama sekali.",
                    "point": 3,
                    "next_scene": 9
                },
                {
                    "choice": "buruk",
                    "teks": "Sari memutuskan untuk tetap menyimpan uangnya.",
                    "moral_value": "Keputusan yang salah bisa membuat hati tidak tenang.",
                    "point": -5,
                    "next_scene": 10
                }
            ],
            "lesson_learned": null,
            "selected_choice": null
        },
        {
            "scene_id": 7,
            "type": "ending",
            "img_url": null,
            "img_description": "Andi, happy and proud, holding the toy he bought with his own savings.",
            "voice_url": null,
            "content": "Andi dengan sabar menabung selama beberapa bulan. Akhirnya, dia bisa membeli mainan yang dia inginkan dengan uangnya sendiri. Dia merasa sangat bangga dan senang.",
            "next_scene": null,
            "branch": null,
            "lesson_learned": "Kesabaran dalam menabung akan membawa kepuasan.",
            "selected_choice": null
        },
        {
            "scene_id": 8,
            "type": "ending",
            "img_url": null,
            "img_description": "Andi looking worried as he owes Sari money.",
            "voice_url": null,
            "content": "Andi meminjam uang dari Sari dan membeli mainan itu. Namun, dia merasa cemas karena harus segera mengembalikan uang Sari. Dia belajar bahwa meminjam uang bisa membuat stres.",
            "next_scene": null,
            "branch": null,
            "lesson_learned": "Meminjam uang tanpa perhitungan bisa menjadi beban.",
            "selected_choice": null
        },
        {
            "scene_id": 9,
            "type": "ending",
            "img_url": null,
            "img_description": "Sari returning the money to Pak Budi, feeling relieved.",
            "voice_url": null,
            "content": "Sari akhirnya memutuskan untuk mengembalikan uang kepada Pak Budi. Dia merasa lega dan lebih baik setelah melakukannya. Kejujuran membuat hati tenang.",
            "next_scene": null,
            "branch": null,
            "lesson_learned": "Mengakui kesalahan dan memperbaikinya adalah tindakan yang tepat.",
            "selected_choice": null
        },
        {
            "scene_id": 10,
            "type": "ending",
            "img_url": null,
            "img_description": "Sari feeling uneasy while holding the extra change.",
            "voice_url": null,
            "content": "Sari memutuskan untuk menyimpan uangnya, tetapi dia terus merasa tidak nyaman. Dia belajar bahwa keputusan yang salah bisa membuat hati tidak tenang.",
            "next_scene": null,
            "branch": null,
            "lesson_learned": "Mengambil hak orang lain membuat hati tidak nyaman dan menimbulkan rasa bersalah.",
            "selected_choice": null
        }
    ],
    "user_story": {
        "visited_scene": [
            1,
            2,
            3,
            4,
            7
        ],
        "choices": [
            {
                "scene_id": 2,
                "choice": "baik",
                "point": 5
            },
            {
                "scene_id": 4,
                "choice": "baik",
                "point": 5
            }
        ],
        "total_point": 10,
        "finished_time": 600
    },
    "cover_img_url": null,
    "cover_img_description": "An illustration of a young boy named Andi standing in front of a local warung, holding a small piggy bank.",
    "description": "This story follows Andi, a young boy learning about financial literacy in a culturally relevant setting. Through his interactions and decisions, he learns about saving, honesty, and budgeting.",
    "estimated_reading_time": 600
}